БухЭксп/InformationRegisters/CW_ОбменГИСЭПДСвязанныеДокументыЭПД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ОбменГИСЭПДСвязанныеДокументыЭПД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СвязанныйЭПД</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументыЭПД</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПроформаТитулаЭПД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ОбменГИСЭПДПроформыТитуловЭПД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ОбменГИСЭПДСвязанныеДокументыЭПД/Ext/ManagerModule.bsl
Процедура ДобавитьЗаписьВРегистр(ЭПД, СвязанныйЭПД) Экспорт  
	
	Запись = РегистрыСведений.CW_ОбменГИСЭПДСвязанныеДокументыЭПД.СоздатьМенеджерЗаписи();
	Запись.ПроформаТитулаЭПД = ЭПД;
	Запись.СвязанныйЭПД = СвязанныйЭПД;
	Запись.Записать(Истина);	
	
КонецПроцедуры  

Функция ПолучитьСвязанныйДокументЭПД(ЭПД) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ОбменГИСЭПДСвязанныеДокументыЭПД.СвязанныйЭПД КАК СвязанныйЭПД
	|ИЗ
	|	РегистрСведений.CW_ОбменГИСЭПДСвязанныеДокументыЭПД КАК CW_ОбменГИСЭПДСвязанныеДокументыЭПД
	|ГДЕ
	|	CW_ОбменГИСЭПДСвязанныеДокументыЭПД.ПроформаТитулаЭПД = &ПроформаТитулаЭПД"; 
	
	Запрос.УстановитьПараметр("ПроформаТитулаЭПД", ЭПД);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СвязанныйЭПД;
	КонецЕсли;
	
КонецФункции
